BackEnd/sistema_corretagem/app/controllers/application_controller.rb

  def current_user
    if decoded_token
      user_id = decoded_token[0]['user_id']
      @user ||= Usuario.find_by(id: user_id) # Usamos ||= para evitar buscas repetidas no mesmo request
---
SELECT "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = 2 LIMIT 1