BackEnd/sistema_corretagem/app/controllers/clientes_controller.rb

SELECT "clientes".* FROM "clientes"
---
  def index
    clientes = Cliente.all