BackEnd/sistema_corretagem/app/controllers/dashboard_controller.rb

  def index
    # Conta os usuários ativos (ativo: true) e inativos (ativo: false)
    ativos = Usuario.where(ativo: true).count
    inativos = Usuario.where(ativo: false).count
---
SELECT COUNT(*) FROM "usuarios" WHERE "usuarios"."ativo" = TRUE
SELECT COUNT(*) FROM "usuarios" WHERE "usuarios"."ativo" = FALSE