BackEnd/sistema_corretagem/app/controllers/usuarios_controller.rb

SELECT "usuarios".* FROM "usuarios"
---
  def index
    usuarios = Usuario.all

INSERT INTO "usuarios" ("nome", "email", "login", "senha", "cpf", "ativo", "created_at", "updated_at") VALUES ('gelber rodolfo', 'gelberr@gelber.com', 'gelberr', '123456', '011.901.624-90', TRUE, '2025-09-17 13:18:44.501955', '2025-09-17 13:18:44.501955') RETURNING "id"
---
  def create
    usuario = Usuario.new(usuario_params)

    # Garante que o primeiro usuário do sistema seja um admin
    usuario.role = Usuario.count == 0 ? :admin : params[:usuario][:role]

    if usuario.save

SELECT "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = 1 LIMIT 1
UPDATE "usuarios" SET "ativo" = FALSE, "updated_at" = '2025-09-19 14:55:34.026163' WHERE "usuarios"."id" = 1
---
  def update
    usuario = Usuario.find(params[:id])
    if usuario.update(usuario_params)

SELECT "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = 1 LIMIT 1
UPDATE "usuarios" SET "ativo" = FALSE, "updated_at" = '2025-09-19 14:55:34.026163' WHERE "usuarios"."id" = 1
---
  def destroy
    usuario = Usuario.find(params[:id])
    if usuario.update(ativo: false)