BackEnd/sistema_corretagem/app/controllers/api/v1/caracteristicas_controller.rb

  def index
    @caracteristicas = Caracteristica.order(:nome) # Busca todas e ordena por nome
---
SELECT "caracteristicas".* FROM "caracteristicas" ORDER BY "caracteristicas"."nome" ASC