BackEnd/sistema_corretagem/app/controllers/api/v1/clientes_controller.rb

SELECT "conjuges".* FROM "conjuges" WHERE "conjuges"."cliente_id" = 1 LIMIT 1
---
  def index
    # Pundit usa a 'Scope' da nossa policy para filtrar a coleção automaticamente.
    # Esta linha substitui todo o 'if/else' de autorização que existia antes.
    @clientes = policy_scope(Cliente)

    # A lógica de paginação e includes que já fizemos continua igual.
    @pagy, @clientes = pagy(@clientes.includes(:endereco, :conjuge))

INSERT INTO "clientes" ("nome", "rg", "cpf", "sexo", "email", "telefone", "created_at", "updated_at", "usuario_id", "data_nascimento", "estado_civil", "profissao", "renda", "nacionalidade", "data_casamento", "regime_bens") VALUES ('Ozorio', '5210401 SSP PE', '12345678908', 'M', 'ozorio@senac.com', '81912345678', '2025-09-30 23:38:20.529326', '2025-09-30 23:38:20.529326', 2, '1985-06-15', 'Solteiro', 'Desenvolvedor de Sistemas', 5000.0, 'Brasil', NULL, '') RETURNING "id"
---
  def create
    @cliente = current_user.clientes.build(cliente_params)

    # Verifica se o usuário tem permissão para criar clientes.
    authorize @cliente

    if @cliente.save

UPDATE "clientes" SET "cpf" = '', "telefone" = '11987654321', "updated_at" = '2025-10-05 23:50:22.497071', "estado_civil" = '1' WHERE "clientes"."id" = 3
---
  def update
    authorize @cliente

    if @cliente.update(cliente_params)

SELECT "clientes".* FROM "clientes" WHERE "clientes"."id" = 3 LIMIT 1
---
  def set_cliente
    # O método 'set_cliente' agora fica muito mais simples.
    # Ele só precisa encontrar o cliente. A autorização de quem pode
    # ou não acessá-lo é feita pelo 'authorize @cliente' em cada ação.
    @cliente = Cliente.find(params[:id])