BackEnd/sistema_corretagem/app/controllers/api/v1/clientes_controller.rb

SELECT "clientes".* FROM "clientes"
---
  def index
    # Lógica de autorização: admin vê todos, corretor vê apenas os seus.
    if current_user.admin?
      @clientes = Cliente.all