BackEnd/sistema_corretagem/app/controllers/api/v1/dashboard_controller.rb

  def admin_dashboard_data
    total_usuarios = Usuario.count
    total_admins = Usuario.where(role: :admin).count
    total_corretores = Usuario.where(role: :corretor).count
---
SELECT COUNT(*) FROM "usuarios"
SELECT COUNT(*) FROM "usuarios" WHERE "usuarios"."role" = 1
SELECT COUNT(*) FROM "usuarios" WHERE "usuarios"."role" = 0

  def corretor_dashboard_data
    # Usamos a associação 'current_user.propostas' para pegar apenas as propostas do corretor logado
    propostas_por_status = current_user.propostas.group(:status).count
    total_clientes = current_user.clientes.count

    {
      tipo_dashboard: 'corretor',
      total_clientes: total_clientes,
      total_imoveis_agenciados: current_user.imoveis.count,
      propostas_por_status: current_user.propostas.group(:status).count
---
SELECT COUNT(*) FROM "imoveis"