BackEnd/sistema_corretagem/app/controllers/api/v1/imoveis_controller.rb

  def index
    # Começamos com uma base de imóveis (todos se for admin, só os do corretor se não for)
    base_imoveis = current_user.admin? ? Imovel.all : current_user.imoveis
---
SELECT "imoveis".* FROM "imoveis"

  def create
    @imovel = current_user.imoveis.build(imovel_params)

    if @imovel.save
---
INSERT INTO "imoveis" ("nome_empreendimento", "tipo", "finalidade", "condicao", "descricao", "quartos", "suites", "banheiros", "vagas_garagem", "metragem", "ano_construcao", "unidades_por_andar", "numero_torres", "andares", "elevadores", "varandas", "valor", "valor_condominio", "valor_iptu", "comodidades", "status", "usuario_id", "created_at", "updated_at", "posicao_solar", "andar") VALUES ('Residencial Teste', '0', '0', '2', 'Apartamento de teste completo', 2, NULL, 2, 1, 65, NULL, NULL, NULL, NULL, NULL, NULL, 350000.0, NULL, NULL, '{}', 0, 2, '2025-10-06 14:33:39.068163', '2025-10-06 14:33:39.068163', NULL, NULL) RETURNING "id"

  def set_imovel
    # Lógica de autorização melhorada:
    # Se o usuário for admin, ele pode encontrar qualquer imóvel.
    # Se for corretor, só pode encontrar os seus.
    if current_user.admin?
      @imovel = Imovel.find(params[:id])
    else
      @imovel = current_user.imoveis.find(params[:id])
---
SELECT "imoveis".* FROM "imoveis" WHERE "imoveis"."id" = 1 LIMIT 1