BackEnd/sistema_corretagem/app/controllers/api/v1/imoveis_controller.rb

  def create
    Rails.logger.info("[ImoveisController#create] Content-Type=#{request.headers['Content-Type']} Accept=#{request.headers['Accept']}")
    Rails.logger.info("[ImoveisController#create] Raw body=#{request.raw_post}")

    begin
      attrs = imovel_params
    rescue ActionController::ParameterMissing => e
      Rails.logger.error("[ImoveisController#create] ParameterMissing: #{e.param} | params=#{params.to_unsafe_h}")
      return render json: { error: "Parâmetro obrigatório ausente ou inválido", param: e.param, params: params.to_unsafe_h }, status: :bad_request
    end

    @imovel = current_user.imoveis.build(attrs)
    authorize @imovel

    if @imovel.save
---
INSERT INTO "imoveis" ("nome_empreendimento", "tipo", "finalidade", "condicao", "descricao", "quartos", "suites", "banheiros", "vagas_garagem", "metragem", "ano_construcao", "unidades_por_andar", "numero_torres", "andares", "elevadores", "varandas", "valor", "valor_condominio", "valor_iptu", "comodidades", "status", "usuario_id", "created_at", "updated_at", "posicao_solar", "andar") VALUES ('Residencial Aurora', 0, 0, 2, 'Imóvel amplo e arejado', 3, NULL, 2, 1, 85, NULL, NULL, NULL, NULL, NULL, NULL, 550000.0, NULL, NULL, '{}', 0, 1, '2025-10-06 17:20:12.203406', '2025-10-06 17:20:12.203406', NULL, NULL) RETURNING "id"