BackEnd/sistema_corretagem/app/controllers/api/v1/perfis_busca_controller.rb

SELECT "clientes".* FROM "clientes" WHERE "clientes"."id" = 1 LIMIT 1
---
  def set_cliente
    # Lógica de autorização melhorada para o admin
    if current_user.admin?
      @cliente = Cliente.find(params[:cliente_id])