BackEnd/sistema_corretagem/app/controllers/api/v1/sessoes_controller.rb

  def create
    user = Usuario.find_by(login: params[:usuario][:login])
---
SELECT "usuarios".* FROM "usuarios" WHERE "usuarios"."login" = 'admin' LIMIT 1