BackEnd/sistema_corretagem/app/controllers/api/v1/usuarios_controller.rb

UPDATE "usuarios" SET "ativo" = FALSE, "updated_at" = '2025-10-06 14:25:47.948991' WHERE "usuarios"."id" = 2
---
  def deactivate
    # Pundit verifica a regra 'deactivate?'.
    # Garante que um admin não pode desativar a si mesmo.
    authorize @usuario

    if @usuario.update(ativo: false)