BackEnd/sistema_corretagem/app/controllers/api/v1/usuarios_controller.rb

  def index
    @usuarios = Usuario.all
---
SELECT "usuarios".* FROM "usuarios"

  def create
    @usuario = Usuario.new(usuario_params)

    # Lógica segura para o primeiro usuário e definição de 'role'.
    # Apenas um admin logado pode definir o 'role' de um novo usuário.
    # Se ninguém estiver logado, assume-se que é o primeiro usuário (admin).
    if current_user&.admin?
      @usuario.role = usuario_params[:role] || :corretor
    else
      @usuario.role = Usuario.count == 0 ? :admin : :corretor
    end

    if @usuario.save
---
SELECT COUNT(*) FROM "usuarios"
INSERT INTO "usuarios" ("nome", "email", "login", "cpf", "ativo", "created_at", "updated_at", "password_digest", "role") VALUES ('rafaella amorim', 'rafaella@senac.com', 'rafaella', '12345678909', TRUE, '2025-09-30 23:28:58.383781', '2025-09-30 23:28:58.383781', '$2a$12$UyyE4NKqMp54asypfaG98ehKyAgQYveeednXGioOKU5BZdoG/hq06', 0) RETURNING "id"

  def update
    if @usuario.update(usuario_params)
---
UPDATE "usuarios" SET "ativo" = TRUE, "updated_at" = '2025-10-06 14:31:31.998444', "password_digest" = '$2a$12$.AIl7/4pOC5DrIycW6BYEOHqOWu1M1A.ORjUBXzYZRF52YB1uKp3G' WHERE "usuarios"."id" = 2

  def destroy
    # Um admin não pode inativar a si mesmo
    if @usuario == current_user
      render json: { error: 'Você não pode inativar sua própria conta.' }, status: :forbidden
      return
    end

    if @usuario.update(ativo: false)
---
UPDATE "usuarios" SET "ativo" = TRUE, "updated_at" = '2025-10-06 14:31:31.998444', "password_digest" = '$2a$12$.AIl7/4pOC5DrIycW6BYEOHqOWu1M1A.ORjUBXzYZRF52YB1uKp3G' WHERE "usuarios"."id" = 2

  def set_usuario
    @usuario = Usuario.find(params[:id])
---
SELECT "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = 2 LIMIT 1